package les;

public class les10 {
    //тст jav - по типу тех, что были
    //открытое - в д/з до половины + ооп(офорить текст с помощью ооп красиво)
    // -str + сортировка
    //remove - до первого вхождения
    // в set - по значениям в List - по элементам
    // чтобы
    // компилятор отображает последнюю ошибку
    // суперкласс
    // timeComplextity
    // алгоритмические сложноти (худшие - O(n)) (вставка в начало - в гудший)
    // get/set O(1) - самая быстрая операция, потому что массив знает о своих индексах.
    // когда использует arrayList, а когда LinkedList(когда часто надо лезить в середину)
    // LinkedList - habr статья
    // вставка в средину в LinkedList(перекидываем ссылки) сложность алгоритмическая O(1), у arrayList O(n)
    // get/set LinkedList O(n)
    // LinkedList построен на нодах, а ArrayList на массиве.
    // ArrayList + HashMap (самые частые)
    // equals HashCode
    // HashCode
    // HashMap
    // метод put всегда вставляет в начало
    // Коллекции + ООП

    public static void main(String[] args) {

    }
}
