package les;

public class les7 {
    // колизия
    // хєш-код контракт между equals и хэш-код
    // что такое immutable класс(что там прайвет, что там паблик)
    // реализация метода equals в классе object
    // Comparable и Comparator(внешн. и внтр. классы)
    // StringBuilder - оптимизатор строк(изменяется строк через append)
    // Вложеные классы/Анонимные классы, классы....
    // Объект внутреннего класса
    // Вложенный класс(как статик объявленный)
    // Класс лоадер (загрузчик классов)
    // При обращении к классу он его подгружает
    // Сортировка класса от меньшего к большему.
    // Патерны
    // Синглтон (LazyHolder)
    // Локальный класс
    // класс, который находится внутри метода
    // лейзи лодинг(познее связывание, ранее связывание, динамическое связывание)
    // фабричный метод(в методе создаем новый объект), тогда это фабричный метод
    // Если видим в методе класс - это локальный класс
    // Анонимный класс
    // функциональный интерфейс (только один абстрактный метод)
    // В лямда выражении нет ссылки this
    // эффективная финализированная переменная
    // в анонимных классах нельзя изменять локальные переменные
    // Исключение, comparator, comparable,
    // Карты, коллекции
    // 12 числа 18:00
    // 21 числа  8:00
    // Конструкторы в enum идут private
    // valueOF примитив в объект обарачивает
    // регулярные выражения RegExp строки
    // 6/7 уроки ess
    // строки плюс тестирование
    // Junit + TDD
    // тест по джаве, открытое занятие, открытое занятие в блокноте
    // локаторы
    // сортировочка перестановочка
}
