package les;

public class third {
    //tosring
    //хэш код
    //@Override - анотация
    // Метод статический виден на уровне класса
    //Анотации(метаданные)
    //super(в конструкторах) - вызов родителя
    //уровень абстракции
    // Наследование через интерфейсы(нельзя наследовать несолько классов)
    //Динамическое связывание
    //upcast/downcast
    //instance of
    //Для работы с классами нужно их изначально заимпортить.
    //Дженерики
    // Топ level class(может быть публичный или пакетный) / Внутренний класс
    // static - на уровне клааса, любая переменная на уровне объекта.
    // Через статик можно глобально ссылаться, если нет статик то не так глобально.(ДОллар) Обращаться через имя класса.
    // Java code convention
    // Консанты: просто инициализ./конструктор/динамический блок/геттер
    // Если что-то дублируется - создаем динамику
    // !Порядок выполнения программы
    // Static final - полноценная константа
    // Class loader
    // Конструктор позже static подгружается
    //саппер
    //Object - родитель всех объектов
    //A b c и что по-умолчанию создается.
    //super/this(super - к конструктору родителя)
    // Наследование is a и has a
    // Наследование - ассоциации (агрегация и композиция) Машина - композиция(двигатель) Агреграция(Машина, окна)
    // QA - две группы - агрегации. Четкая привязанность - композиция.
}
